u2re-dev/IoT-dev/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MATTER_ENABLE_DATA_MODEL=y
CHIP_SYSTEM_CONFIG_USE_NETWORK_FRAMEWORK=1
CHIP_SYSTEM_CONFIG_USE_SOCKETS=1
CHIP_SYSTEM_CONFIG_USE_LWIP=1
CHIP_DEVICE_CONFIG_MAX_DISCOVERED_IP_ADDRESSES=8
